In [2]:
import cx_Oracle
import pandas as pd

In [7]:
# conn = cx_Oracle.connect('open_source/1111@192.168.0.78:1521/xe')
conn = cx_Oracle.connect('hr/hr@192.168.0.78:1521/xe')

In [8]:
cur = conn.cursor()
cur.execute("""
select * from employees
""")

In [9]:
df = pd.DataFrame(cur)
df

,0,1,2,3,4,5,6,7,8,9,10
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [2]:
conn = cx_Oracle.connect('open_source/1111@localhost:1521/xe')
cur = conn.cursor()
cur.execute("""
SELECT column_name from cols
where table_name = 'MUSEUM'
""")

In [3]:
column_list = [record[0] for record in cur]
column_list

['시설명',
 '박물관미술관구분',
 '소재지도로명주소',
 '위도',
 '경도',
 '운영기관명',
 '편의시설정보',
 '어른관람료',
 '청소년관람료',
 '어린이관람료',
 '제공기관코드']

In [6]:
cur.execute('select * from museum')
df = pd.DataFrame(cur, columns=column_list)
df.head()

,시설명,박물관미술관구분,소재지도로명주소,위도,경도,운영기관명,편의시설정보,어른관람료,청소년관람료,어린이관람료,제공기관코드
0,김영갑갤러리 (두모악),사립,제주특별자치도 서귀포시 성산읍 삼달로 137,33.372368,126.854246,두모악,None,4500,3000,1500,6500000
1,자연사랑 미술관,사립,제주특별자치도 서귀포시 표선면 가시로613번길 46,33.355650,126.771933,자연사랑,None,3000,1000,0,6500000
2,제주 현대미술관,공립,제주특별자치도 제주시 한경면 저지14길 35,33.339693,126.265692,제주 현대미술관,None,2000,1000,500,6500000
3,돌하르방미술관,사립,제주특별자치도 제주시 조천읍 북촌서1길 70,33.538848,126.688812,북촌돌하르방공원,None,7000,5000,0,6500000
4,제주조각공원,사립,제주특별자치도 서귀포시 안덕면 일주서로 1836,33.254130,126.322287,제주조각공원,None,8000,6000,5000,6500000

In [8]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2079 entries, 0 to 2078
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   시설명       2079 non-null   object
 1   박물관미술관구분  2079 non-null   object
 2   소재지도로명주소  2078 non-null   object
 3   위도        2079 non-null   float64
 4   경도        2078 non-null   float64
 5   운영기관명     2079 non-null   object
 6   편의시설정보    404 non-null    object
 7   어른관람료     2079 non-null   int64
 8   청소년관람료    2079 non-null   int64
 9   어린이관람료    2079 non-null   int64
 10  제공기관코드    2079 non-null   object
dtypes: float64(2), int64(3), object(6)
memory usage: 1.1 MB

In [7]:
df.memory_usage(deep=True)

Index          128
시설명         203614
박물관미술관구분    178794
소재지도로명주소    256286
위도           16632
경도           16632
운영기관명       202371
편의시설정보       83392
어른관람료        16632
청소년관람료       16632
어린이관람료       16632
제공기관코드      133056
dtype: int64

In [9]:
del df

---

## Selection and Projection Query

In [11]:
cur.execute("""
SELECT 시설명, 박물관미술관구분,청소년관람료
from museum
where 청소년관람료 > 1500
""")

In [12]:
print("Selection and Projection Query")
df = pd.DataFrame(cur, columns=['시설명', '박물관미술관구분','청소년관람료'])
df.head()

Selection and Projection Query

            시설명 박물관미술관구분  청소년관람료
0  김영갑갤러리 (두모악)       사립    3000
1       돌하르방미술관       사립    5000
2        제주조각공원       사립    6000
3      제주 유리의 성       사립    9000
4      박물관은살아있다       사립   13000

In [13]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 562 entries, 0 to 561
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   시설명       562 non-null    object
 1   박물관미술관구분  562 non-null    object
 2   청소년관람료    562 non-null    int64
dtypes: int64(1), object(2)
memory usage: 105.3 KB